<template>
    <div class='buy-american'>

      <h1><a class="icon icon-left pull-left" @click='$router.go(-1)'></a>《K5电竞平台购买条款》</h1>
      <p>您在点击购买之前，应当认真阅读本协议。<span>请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款。</span>若您对协议有任何疑问，可向K5电竞平台客服咨询。</p>
        
    <p>您应确保您的账户为您本人或您所授权的代理人所使用，代表您的真实意思表示，您对该购买行为所产生的结果已知悉，否则，一切后果由您自行承担。</p>
    <p>您已明确知悉所购买的商品的品名、价格、数量、型号、规格或服务的时间、内容、限制性要求等事项，并对上述事项予以认可并确认。</p>
    <p>您点击购买并付款后，您与卖方即形成买卖合同关系，若出现纠纷，您应向卖方主张权利，由您与卖方协商解决或经法律途径解决，K5电竞平台不承担任何责任。</p>
    <p>因您所购买的商品系虚拟物品，请在确认实际收到商品后再确认付款，若您未确认收到商品就将款项支付给卖方，因此产生纠纷的，由您与卖方自行协商解决或经法律途径解决，与K5电竞平台无关。</p>
    <p>若您购买服务后，卖方并未按约定提供服务，您可向K5电竞平台投诉，K5电竞平台将尽最大努力督促卖方履约，但若卖方一直未按约提供服务，则您可经法律途径解决，由此产生的纠纷系您与卖方之间的纠纷，与K5电竞平台无关。</p>
    <p>您购买商品/服务后，您的身份信息可能会向卖方披露，若因此导致您的身份信息泄露而对您造成损失，则您应向卖方主张赔偿，K5电竞平台不承担任何责任。</p>
    <p>当您按照提示确认购买后，即表示您已充分阅读、理解并接受本协议的全部内容。<span>若您不同意本协议或其中任何条款约定，请您立即停止购买。</span></p>

    </div>
</template>

<style lang="scss" scoped>
    @import '../../assets/css/market.scss';
</style>

<script charset="UTF-8">
  import * as checkJs from '../../assets/js/pubFunc'
  export default{
    computed:{

    },
    mounted () {

        },
    data () {
      return {

      }
    },
    components: {

    },
    methods: {

    },
  }
</script>
